Revit 2027 API
BuiltInFailures.BeamFailures.CannotBendBeamType Property
 Can't bend beam type "[Type Name]" along its location line. The beam is either too large or its curve is too sharp. You may be able to resolve the problem by reducing the beam's width in the bending direction, or by reducing acute angles in the curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotBendBeamType { get; }
Public Shared ReadOnly Property CannotBendBeamType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotBendBeamType {
	FailureDefinitionId^ get ();
}
static member CannotBendBeamType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BeamFailures Class
Autodesk.Revit.DB Namespace